/* -------------------------------------------------------------------------------------------------------------------*/
/*--------------------------------------------------------------------------------------------------------------------*/
/*  DANNY JOSE JIMENEZ GUTIERREZ                                                                                      */
/*  TELEFONO :0424-281-44-55                                                                                          */
/*  CORREO : DENNALY88@GMAIL.COM                                                                                      */
/*  INGENIERO EN SISTEMAS                                                                                             */
/*--------------------------------------------------------------------------------------------------------------------*/
/*--------------------------------------------------------------------------------------------------------------------*/
/*  CUA , ESTADO MIRANDA 2025                                                                                         */
/*  CURSO DE C                                                                                                        */
/*  APLICACIÓN PARA CORRER LOS EJERCICIOS ES CODE::BLOCKS                                                             */
/* -------------------------------------------------------------------------------------------------------------------*/
/* -------------------------------------------------------------------------------------------------------------------*/


/*_________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________*/
/*   Ejercicio Nº 63 Estructura de Datos Tipo Vector : Se tienen las notas del primer parcial de los alumnos de dos cursos, el curso A y el curso B, cada curso cuenta con 5 alumnos.
       Realizar un programa que muestre el curso que obtuvo el mayor promedio general.
/*_________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________*/

#include <stdio.h>
#include <stdlib.h>
#include <stdbool.h>

int main()
{
int i;
int cursoA[5];
int cursoB[5];
int sumaA;
int sumaB;
int promA;
int promB;


sumaA = 0 ;
sumaB = 0 ;


printf("\n-----------------------------------------------------\n");
printf("Notas del primer parcial de los alumnos de dos cursos :\n");
printf("\n-----------------------------------------------------\n");

printf("\n--------------------------------\n");
printf("El curso A");
printf("\n--------------------------------\n");


for (i = 0; i < 5; i++) {
        printf("Nota del Primer Parcial del Alumno numero  %d: ", i + 1);
        scanf("%d", &cursoA[i]);
        sumaA = sumaA + cursoA[i];


    }

printf("\n--------------------------------\n");
printf("El curso B");
printf("\n--------------------------------\n");

  for (i = 0; i < 5; i++) {
        printf("Nota del Primer Parcial del Alumno numero  %d: ", i + 1);
        scanf("%d", &cursoB[i]);
        sumaB = sumaB + cursoB[i];


    }


promA = sumaA / 5 ;

promB = sumaB / 5 ;


    if (promA>promB){

                 printf("El promedio mayor es el Curso A con   %d: ",promA );


    }else
    if (promB>promA){

                 printf("El promedio mayor es el Curso B con   %d: ",promB );


    }else
    if (promA==promB){

                 printf("Los Promedios son Iguales  %d: ",promA ,promB  );


    }


    return 0;
}



/* -------------------------------------------------------------------------------------------------------------------*/
/*--------------------------------------------------------------------------------------------------------------------*/
/*  DANNY JOSE JIMENEZ GUTIERREZ                                                                                      */
/*  TELEFONO :0424-281-44-55                                                                                          */
/*  CORREO : DENNALY88@GMAIL.COM                                                                                      */
/*  INGENIERO EN SISTEMAS                                                                                             */
/*--------------------------------------------------------------------------------------------------------------------*/
/*--------------------------------------------------------------------------------------------------------------------*/
/*  CUA , ESTADO MIRANDA 2025                                                                                         */
/*  CURSO DE C                                                                                                        */
/*  APLICACIÓN PARA CORRER LOS EJERCICIOS ES CODE::BLOCKS                                                             */
/* -------------------------------------------------------------------------------------------------------------------*/
/* -------------------------------------------------------------------------------------------------------------------*/
