/* -------------------------------------------------------------------------------------------------------------------*/
/*--------------------------------------------------------------------------------------------------------------------*/
/*  DANNY JOSE JIMENEZ GUTIERREZ                                                                                      */
/*  TELEFONO :0424-281-44-55                                                                                          */
/*  CORREO : DENNALY88@GMAIL.COM                                                                                      */
/*  INGENIERO EN SISTEMAS                                                                                             */
/*--------------------------------------------------------------------------------------------------------------------*/
/*--------------------------------------------------------------------------------------------------------------------*/
/*  CUA , ESTADO MIRANDA 2025                                                                                         */
/*  CURSO DE C                                                                                                        */
/*  APLICACIÓN PARA CORRER LOS EJERCICIOS ES CODE::BLOCKS                                                             */
/* -------------------------------------------------------------------------------------------------------------------*/
/* -------------------------------------------------------------------------------------------------------------------*/


/*_________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________*/
/*   Ejercicio Nº 59 Estructura de Datos Tipo Vector : Definir un vector de 5 componentes de tipo float que representen las alturas de 5 personas.
       Obtener el promedio de las mismas. Contar cuántas personas son más altas que el promedio y cuántas más bajas.
/*_________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________*/

#include <stdio.h>
#include <stdlib.h>
#include <stdbool.h>

int main()
{


float alturas[5];
int i,proal,prob;
float prom,sum;

prom  = 0 ;
proal = 0 ;
prob  = 0 ;

    printf("Por favor, ingresa la altura de 5 personas :\n");

    for (i = 0; i < 5; i++) {
        printf("Ingresa la altura de la persona %d: ", i + 1);
        scanf("%f", &alturas[i]);
        prom = prom + alturas[i] ;
        sum = prom / 5 ;

    }


    for (i = 0; i < 5; i++) {
        if (sum<alturas[i]){
             proal = proal +1 ;

        }else
        if (sum>alturas[i]){
             prob = prob +1 ;

        }


    }



    printf("\nAltura de las Personas :\n");

    for (i = 0; i < 5; i++) {
        printf("La Altura de la persona es  %.2f \n", alturas[i]);
    }


        printf("El Promedio es  %.2f \n",sum);
        printf("Cuántas personas son más altas que el promedio  %d \n",proal);
        printf("Cuántas personas son más baja que el promedio  %d \n",prob);

    return 0;
}


/* -------------------------------------------------------------------------------------------------------------------*/
/*--------------------------------------------------------------------------------------------------------------------*/
/*  DANNY JOSE JIMENEZ GUTIERREZ                                                                                      */
/*  TELEFONO :0424-281-44-55                                                                                          */
/*  CORREO : DENNALY88@GMAIL.COM                                                                                      */
/*  INGENIERO EN SISTEMAS                                                                                             */
/*--------------------------------------------------------------------------------------------------------------------*/
/*--------------------------------------------------------------------------------------------------------------------*/
/*  CUA , ESTADO MIRANDA 2025                                                                                         */
/*  CURSO DE C                                                                                                        */
/*  APLICACIÓN PARA CORRER LOS EJERCICIOS ES CODE::BLOCKS                                                             */
/* -------------------------------------------------------------------------------------------------------------------*/
/* -------------------------------------------------------------------------------------------------------------------*/
